app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "comment test text to see comment"], ["message_id", 9], ["created_at", "2018-02-16 04:11:35.145893"], ["updated_at", "2018-02-16 04:11:35.145893"]]
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["user_id", 5], ["updated_at", "2018-02-16 04:18:09.448333"], ["id", 2]]
---
	def create
		@comment = @message.comments.create(comment_params)
		@comment.user_id = current_user.id

		if @comment.save