app/controllers/messages_controller.rb

INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Admin ID Test"], ["description", "ID Test"], ["user_id", 4], ["created_at", "2018-02-15 23:35:18.100975"], ["updated_at", "2018-02-15 23:35:18.100975"]]
---
	def create
		#@message = current_user.messages.build(message_params)
		@message = Message.new(message_params)
		if @message.save

UPDATE "messages" SET "title" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["title", "Test Message 3"], ["updated_at", "2018-02-14 08:21:53.428579"], ["id", 3]]
---
	def update
		if @message.update(message_params)