app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Hello world!"], ["user_id", 1], ["created_at", "2017-12-19 15:39:58.550890"], ["updated_at", "2017-12-19 15:39:58.550890"]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save